<template>
  <q-page class="term">
    <div class="row long-padded">
      <div class="col-12">
        <h6 class="text-center text-black fluid">
          使用者同意書(施工中，待修改，金流的部分需要拿掉)
        </h6>

        <p>
          本使用者同意書（下稱「本同意書」）構成使用者（下稱「您」）使用共學島股份有限公司
          （下稱「本公司」）提供之「線下教學課程之網際網路媒合」服務之權利義務關係，敬請仔細閱讀。
        </p>

        <p></p>
        <p class="bold">第1條（合約審閱期間及基本資料）</p>

        <p>
          本公司提供之「線下教學課程之網際網路媒合」服務，係指本公司授權您於本公司網站（網址：www.colearna.co，下稱「本網站」）及共學島（Colearna）APP（下稱「本軟體」）（本網站及本軟體，下合稱「本平台」），使用本公司藉網際網路提供之線下教學（面對面教學）媒合服務或其他相關服務（下稱「本服務」），尋找符合您學習需求之課程提供者（下稱「老師」），並由您與老師達成線下教學課程之服務協議（下稱「教學服務協議」）。關於本服務之權利義務，悉依本同意書條款訂定之。
        </p>

        <p>立約人：</p>

        <p>
          您：即於申請本服務時勾選「我已閱讀並同意本使用者同意書之條款」者，即視為您已審閱本同意書，並同意與本公司締約。倘若您不具有完全行為能力（包括但不限於未滿十八歲之未成年人），請於使用本服務前取得您的法定代理人同意；倘若您繼續使用本服務，視為您已取得法定代理人之同意與許可。您的個人資料與課程資料皆已載明於個人頁面/會員中心資料中。
        </p>

        <p>本公司：共學島股份有限公司</p>
        <p>負責人：Chau Chris Yat Kin</p>
        <p>登記地址：臺北市大安區敦化南路二段77號7樓之4</p>
        <p>統一編號： 90611740</p>

        <p></p>
        <p class="bold">第2條（本服務內容）</p>

        <p>
          本服務範圍包括本平台內線下教學課程之網際網路媒合服務。您理解並同意本公司並非與您或與老師訂立教學服務協議之一方。本公司無法控制您選擇哪位老師，也無法控制老師使用之教材、教學時間，亦無法保證老師將持續在本平台授課。您理解並同意，本公司無法替老師之言論及行為負責，老師亦非本公司之受雇人、代理人。
        </p>

        <p>
          使用本服務的您，建議應具有一般識字能力基礎，惟您仍應依據個人狀況或參閱本平台服務介紹，評估是否使用本服務。
        </p>

        <p>
          本服務提供您線下教學課程之網際網路媒合服務，您得於本平台上搜尋個別老師提供之教學課程名稱、內容、費用、場地等資訊，經您評估篩選後，您得於本平台選擇向老師購買特定之教學課程，並由該位老師與您進行線下課程（面對面教學）之教學。您理解並同意：本平台僅提供線下教學之媒合服務，並非教學課程之製作者，亦非教學場地之提供者，如您於教學過程中，您因此受有任何損害或損失，您應向老師或場地提供者或其合作業者請求損害賠償，本平台概不負責。
        </p>

        <p>
          本平台中無關於本服務之所有廣告內容、文字與圖片之說明、展示樣品或其他銷售資訊，均係由各廣告商、產品與服務的供應商所設計與提出，您應對於廣告之正確性與可信度自行斟酌與判斷，本平台僅接受委託予以刊登，不對前述廣告負擔保責任。
        </p>

        <p>
          本公司有權拍照、攝影教學課程之進行，以確保您於教學課程出現意外或有爭議之狀況時有客觀的憑證。本公司所持有之照片、影片將不會任意公開予第三人（除政府或法規要求）。本公司將於持有該照片、影片後2年後刪除、銷毀之。
        </p>

        <p></p>
        <p class="bold">第3條（付款規範）</p>

        <p>
          當您於購買課程頁面點選「前往付款」按鈕，您即授權本公司及喬睿科技股份有限公司（下稱：TapPay）依您所選擇付款方式（不論是以信用卡一次付清或分期付款，或者以匯款方式付款）收取課程費用後，給付予本公司。您並同意本公司、TapPay於完成交易目的範圍內蒐集及使用您之個人資料，包括但不限於銀行帳號、信用卡號、信用卡有效期限、聯絡方式等。
        </p>

        <p>
          本服務採面對面教學，您可自由選擇是否與本公司配合之保險機構，於本服務中加購保險項目，經您點選加購並提供必要個人資料，您同意本公司、保險機構於完成交易目的範圍內蒐集及使用您之個人資料，包括但不限於保險人與被保險人姓名、身分證字號、生日等。
        </p>

        <p>
          如您逾期未繳納應繳納全部/部份之費用，本公司得以十日之催告期間請求您給付，逾期您仍未完全給付者，本公司得終止本同意書，終止提供本服務並向您請求積欠之費用及依週年利率百分之五計算之遲延利息。
        </p>

        <p></p>
        <p class="bold">第4條（退款規範）</p>

        <p>
          您得寄信至本平台之客服信箱 contact@colearna.co
          申請退款並檢附合理退款原因，經本公司審查後，本公司得依照下列規定，退還全部/部份已付款項（但退款金額需扣除轉帳或信用卡手續費）：
        </p>

        <p>實體課</p>

        <p>尚未開課課程之退款條件：</p>
        <p>(1)於開課日七日（含當日）前，得退還該課程金額之百分之百。</p>
        <p>(2)於開課日五日（含當日）前，得退還該課程金額之百分之七十。</p>
        <p>(3)於開課日三日（含當日）前，得退還該課程金額之百分之五十。</p>
        <p>(4)若您錯過上述所列的退款期限，不予退款</p>
        <p>
          (5)以上開課日期間之計算，均不計入開課日。（例如：開課日為1月8日，則於1月1日前或1月1日當日得退款百分之百、於1月3日前或1月3日當日得退款百分之七十、於1月5日前或1月5日當日得退款百分之五十，如至1月8日開課日當日始申請退款，則不予退款。）
        </p>
        <p>已開課課程（非單次課程之情形）之退款條件：</p>
        <p>(1)於您購買課程之當日，得退還該課程金額之百分之百。</p>
        <p>(2)於您購買課程後三日內（含當日），得退還該課程金額之百分之七十。</p>
        <p>(3)於您購買課程後五日內（含當日），得退還該課程金額之百分之五十。</p>
        <p>(4)於您購買課程後逾七日（含當日），不予退款。</p>
        <p>
          (5)以上購買課程日期之計算，以購買日起算。（例如：購買日為1月1日，則於1月1日當日得退款百分之百、1月3日前或1月3日當日得退款百分之七十、1月5日前或1月5日當日得退款百分之五十，如至1月7日始申請退款，已逾購買課程後之七日（含當日），則不予退款。）
        </p>
        <p>包含線上形式進行之課程</p>

        <p>尚未開課課程之退款條件：</p>
        <p>(1) 於開課日七日（含當日）前，得退還該課程金額之百分之百。</p>
        <p>(2) 於開課日五日（含當日）前，得退還該課程金額之百分之七十。</p>
        <p>(3) 於開課日三日（含當日）前，得退還該課程金額之百分之五十。</p>
        <p>
          (4)
          若您用戶錯過上述所列的退款期限，不予退款，但平台將贈送相同課堂價格面額（扣除行政費後）之折價券供下次於平台購課使用。
        </p>

        <p>已開課課程（非單次課程之情形）之退款條件：</p>
        <p>(1) 開課日前之退款要求等同上述單次課之規範。</p>
        <p>
          (2)
          首節課堂結束後至第二堂課之前（不含當日），得退還等同該課程價值之之抵用券（扣除行政費）以供往後於本平台使用。
        </p>
        <p>
          (3) 於第二堂課當日及以後，平台得視乎具體情況決定如何處理退款申請。
        </p>

        <p>
          如老師有違反其與本公司所約定之合約，且老師未依本公司指示進行改善或拒絕修正，本公司將下架該課程，並依下列方式向您辦理退費（但退款金額需扣除轉帳或信用卡手續費）：
        </p>
        <p>(1)若下架之課程為尚未開課，本公司將全額退款。</p>
        <p>
          (2)若下架之課程已開課且尚餘課堂數，本公司於下架該課程後，本公司得視具體情況是否退款及退款金額。
        </p>

        <p>
          如課堂於開課前未達成班人數（包括單次課及超過一堂課的課程，即「多次課」），平台將提前通知。如課程屬單次課，將安排退款；如課程屬多次課，則安排退款不成班之該次課堂款項（用戶之購買價格除以課堂數目），用戶亦可申請退還餘下未上課堂之費用。
        </p>

        <p>
          如學生遲到/缺席且未有於課堂開始前至少一小時告知，恕未能退還該堂款項。如課堂開始後15分鐘出席學生數目仍未達成班人數，老師得決定是否取消課堂，已出席之學生將獲退還該堂費用。
        </p>

        <p></p>
        <p class="bold">第5條（設備規格）</p>

        <p>
          利用本平台使用本服務應具備之各項軟硬體設備基本規格及要求如下，您應於使用本服務前，自行準備以下設備，設備要求之更新請詳見本平台公告：
        </p>
        <p>最新版本之Google Chrome網路瀏覽器。</p>
        <p>
          如使用本軟體，應下載並安裝其最新版本於具備iOS系統或Android系統之手機或平板。
        </p>
        <p>
          您連結本平台之接取網路，應由您自行向合法經營之電信事業申請租用，您租用該接取網路所生之權利義務，依您與該電信事業間合約訂定之。
        </p>
        <p>
          中國大陸地區及港澳地區因地區使用限制可能無法使用全部或部分本服務，您於使用本服務前應自行確認所在之地區是否有前述限制。本公司不因前述限制而終止本合約或退費。
        </p>

        <p></p>
        <p class="bold">第6條（擔保授權）</p>
        <p>本公司聲明，本公司為本同意書授權您使用之服務內容之合法權利人。</p>
        <p>未經本公司事前之書面同意，您不得將其使用權讓與他人使用。</p>

        <p></p>
        <p class="bold">第7條（使用規則）</p>
        <p>
          您有下列情形之一者，由您自負一切法律責任，本公司並得通知您終止本同意書，您不得拒絕：
        </p>
        <p>您蓄意散佈干擾本公司網路系統正常運作之電腦程式。</p>
        <p>
          您在本平台上散佈恐嚇、毀謗、侵害他人隱私、色情或其他違反強制或禁止規定、公序良俗之文字、圖片或影像。
        </p>
        <p>
          您利用本平台從事其他不法或違反本同意書約定事項之行為，其情節重大，且經本公司通知您限期改正而屆期未改正者，本公司得通知您終止本同意書，您不得拒絕。
        </p>

        <p></p>
        <p class="bold">第8條（使用者之義務）</p>
        <p>您對於您之使用者帳號與個人密碼有妥善保管以避免第三人知悉之義務。</p>
        <p>您在使用本服務時，有遵守本同意書所約定之授權使用原則之義務。</p>
        <p>
          您依本同意書之約定所註冊之個人資料有錯誤或已變更者，應儘速通知本公司請求更正。如因您怠於通知而致其權益受損者，應由您自行負責。
        </p>
        <p>
          為確保兒童及青少年使用網路的安全，並避免隱私權受到侵犯，未滿十二歲之兒童使用本服務時，法定代理人應全程在旁陪伴，十二歲以上未滿十八歲之青少年使用本服務前，法定代理人亦應斟酌是否給予同意。
        </p>
        <p>
          您同意不會將課堂中所拍攝涉及第三人（例如：其他學員）之相片或影片公開，除非已徵得所有被拍攝者之同意。
        </p>
        <p></p>
        <p class="bold">第9條（智慧財產權保護）</p>
        <p>
          本平台所使用之軟體或程式，包括但不限於著作、圖片、檔案、資訊、資料、網站架構、網站畫面的安排、網頁設計，均由本平台依法擁有其智慧財產權，包括但不限於商標權、專利權、著作權、營業秘密與專有技術等。
        </p>
        <p>
          任何人不得逕自使用、修改、重製、公開播送、改作、散佈、發行、公開發表、進行還原工程、解編或反向組譯本平台所使用之軟體或程式。
        </p>
        <p>
          若您欲引用或轉載前述軟體、程式，必須依法取得本平台的事前書面同意。
        </p>
        <p>
          尊重智慧財產權是您應盡的義務，如有違反，您應對本平台負損害賠償責任（包括但不限於：訴訟費用、律師費用等）。
        </p>
        <p>
          在尊重他人智慧財產權之原則下，您同意在使用本平台之服務時，不為侵害他人智慧財產權之行為。
        </p>
        <p>
          您知悉並同意：若您因使用本平台而產生之內容，或在本平台「聊天室」、「論壇」及「留言板」服務或類似之討論區功能有涉及侵害第三人智慧財產權或其他權利、涉犯刑事犯罪者，本公司公司得在經權利人通知後，移除或禁止存取該等侵權內容。
        </p>
        <p>
          若您發現智慧財產權遭侵害之情事，請將所遭侵權之情形及聯絡方式，並附具真實陳述及擁有合法智慧財產權之聲明，來信至本公司之客服信箱。
        </p>

        <p></p>
        <p class="bold">第10條（帳號密碼非法使用之處理）</p>
        <p>
          以您之使用者帳號與個人密碼，登入本平台系統所為之行為，推定為您之行為。
        </p>
        <p>
          當您發現您之使用者帳號或個人密碼遭第三人不法或不當之使用者，應立即通知本公司。如您未即時通知本公司，因此致本公司授有損害，您應對本平台負損害賠償責任（包括但不限於：訴訟費用、律師費用等）。
        </p>

        <p></p>
        <p class="bold">第11條（暫停服務之處理）</p>
        <p>
          本公司對於本服務相關軟硬體設備，進行營運上必要之搬遷、更換、升級、保養或維修時，得暫停本服務之全部或一部。
        </p>
        <p>
          本公司因本條前項事由而暫停本服務之全部或一部，得於本平台系統公告之，或以電子郵件或書面通知您。
        </p>

        <p></p>
        <p class="bold">第12條（合約之變更）</p>
        <p>
          本公司修改本同意書時，將於本平台系統公告之，或以電子郵件或書面通知您。
        </p>
        <p>
          您未為反對之表示且繼續使用本服務者，視為您已同意本同意書變更後之內容。
        </p>

        <p></p>
        <p class="bold">第13條（終止）</p>
        <p>
          您得寄信至本平台之客服信箱請求終止本合約，經本公司同意後，本同意書即告終止，惟如本同意書終止係因本同意書第七條之原因或其他可歸責於您之事由，則您同意本公司概不退還已收取之款項。
        </p>

        <p></p>
        <p class="bold">第14條（申訴權利）</p>
        <p>
          您對於本公司所提供之本服務，您得撥打本公司電話提出申訴，或寄信至本平台之客服信箱申訴。
        </p>

        <p></p>
        <p class="bold">第15條（管轄法院）</p>
        <p>
          因本同意書所生之一切爭議，雙方當事人同意適用臺灣法律作為判斷之準據，並以臺灣臺北地方法院為第一審管轄法院。
        </p>

        <p></p>
        <p class="bold">第16條（通知）</p>
        <p>
          除本同意書另有規定外，本公司因本同意書需對您發出通知，可透過本平台公告、電子郵件、手機簡訊或一般書面寄送等方式進行；並於通知發出之日視為已送達收件人。
        </p>
        <p>
          您對於本公司或本平台之通知，得透過本公司之客服信箱傳遞；該通知以本公司或本平台實際收到日為送達日。
        </p>

        <p></p>
        <p class="bold">第17條（其他）</p>
        <p>
          如本同意書中之任何條款一部或全部無效，其餘條款仍應維持效力且有拘束力。
          本同意書各項標題僅供參考之用，不影響各該約款之解釋。
        </p>
      </div>
    </div>
  </q-page>
</template>

<script lang="ts">
import { useMeta } from 'quasar';

import { Meta } from 'components/models';
// import ExampleComponent from 'components/ExampleComponent.vue';
// import InApp from 'detect-inapp';
import { defineComponent, ref } from 'vue';

export default defineComponent({
  name: 'TermPage',
  // components: { ExampleComponent },
  props: [
    'uid',
    'me',
    'users',
    'user',
    'email',
    'photoURL',
    'isLogout',
    'isInApp',
  ],
  setup() {
    const show = ref([]);
    const metaData = {
      title: '使用者同意書',
      noscript: {
        default: 'This is content for browsers with no JS (or disabled JS)',
      },
    };
    useMeta(metaData);

    const meta = ref<Meta>({
      totalCount: 1200,
    });
    const step = ref(0);

    return { meta, step, show };
  },
  mounted() {
    // setInterval(this.go, 1000)
  },
  methods: {
    go() {
      this.$nextTick(() => {
        this.step++;
      });
    },
    loginGoogle() {
      this.$emit('loginGoogle');
    },
    logout() {
      this.$emit('logout');
    },
  },
});
</script>

<style scoped>
.term {
  max-width: 680px;
  margin: 0 auto;
  background-color: #eee;
}

.about_card {
  width: 45%;
  margin: 1.6em;
  min-width: 360px;
  max-width: 380px;
  height: 600px;
  padding: 1em;
}

.about_card h4 {
  font-size: 28px;
  font-weight: 700;
  font-family: 'Inter';
  margin-bottom: 2em;
}

.about_card p {
  font-size: 24px;
  font-weight: 400;
  font-family: 'Inter';
}

.bk {
  background-image: url('/img/about_decade_bk.png');
  background-repeat: no-repeat;
  overflow: visible;
  padding: 0;
  height: 3em;
  width: 6em;
}

h6 {
  font-size: 24px;
  font-weight: 700;
  font-family: 'Inter';
  margin-bottom: 20px;
}

p,
button {
  padding: 0;
  margin: 0.2em;
  color: black;
  font-size: 16px;
}

p {
  min-height: 1em;
}

button:hover {
  text-decoration: underline;
}

.q-separator {
  margin-top: 1em;
  margin-bottom: 1em;
}

.q-btn:hover {
  text-decoration: underline;
}
/* Single Page Style*/
</style>
